osb-acceptance-test/src/ValidationWSSOAP_TestSuite-Operation_TestCase-Operation-0-UNKNOWN.txt

Status: UNKNOWN
Time Taken: 482
Size: 260
Timestamp: Wed Mar 30 12:32:11 IST 2016
TestStep: Operation

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Encoding: UTF-8
Endpoint: http://localhost:7001/XSDvalidation/in

---------------- Request ---------------------------
Request Headers: Host : localhost:7001
Content-Length : 348
SOAPAction : "http://whitehorses.nl/validation/Operation"
Accept-Encoding : gzip,deflate
User-Agent : Apache-HttpClient/4.1.1 (java 1.5)
Connection : Keep-Alive
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:req="http://whitehorses.nl/request">
   <soapenv:Header/>
   <soapenv:Body>
      <req:request>
         <req:runid>1</req:runid>
         <!--Optional:-->
         <req:message>Hello</req:message>
      </req:request>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Date : Wed, 30 Mar 2016 07:02:11 GMT
#status# : HTTP/1.1 200 OK
Content-Length : 260
Content-Type : text/xml; charset=utf-8
X-Powered-By : Servlet/2.5 JSP/2.1


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <res:response xmlns:res="http://whitehorses.nl/response">
         <res:runid>1</res:runid>
      </res:response>
   </soapenv:Body>
</soapenv:Envelope>
